Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM048.atdf
      <value-group caption="DMA Module Busy bit" name="DMACON__DMABUSY">
         <value caption="DMA module is active" name="" value="0x1" />
         <value caption="DMA module is disabled and not actively transferring data" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Suspend bit" name="DMACON__SUSPEND">
         <value caption="DMA transfers are suspended to allow CPU uninterrupted access to data bus" name="" value="0x1" />
         <value caption="DMA operates normally" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA On bit" name="DMACON__ON">
         <value caption="DMA module is enabled" name="" value="0x1" />
         <value caption="DMA module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Read/Write Status bit" name="DMASTAT__RDWR">
         <value caption="Last DMA bus access was a read" name="" value="0x1" />
         <value caption="Last DMA bus access was a write" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Channel Select bits" name="DCRCCON__CRCCH">
         <value caption="CRC is assigned to Channel 7" name="" value="0x7" />
         <value caption="CRC is assigned to Channel 6" name="" value="0x6" />
         <value caption="CRC is assigned to Channel 5" name="" value="0x5" />
         <value caption="CRC is assigned to Channel 4" name="" value="0x4" />
         <value caption="CRC is assigned to Channel 3" name="" value="0x3" />
         <value caption="CRC is assigned to Channel 2" name="" value="0x2" />
         <value caption="CRC is assigned to Channel 1" name="" value="0x1" />
         <value caption="CRC is assigned to Channel 0" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Type Selection bit" name="DCRCCON__CRCTYP">
         <value caption="The CRC module will calculate an IP header checksum" name="" value="0x1" />
         <value caption="The CRC module will calculate a LFSR CRC" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Append Mode bit" name="DCRCCON__CRCAPP">
         <value caption="The DMA transfers data from the source into the CRC but NOT to the destination. When a block transfer completes the DMA writes the calculated CRC value to the location given by CHxDSA" name="" value="0x1" />
         <value caption="The DMA transfers data from the source through the CRC obeying WBO as it writes the data to the destination" name="" value="0x0" />
      </value-group>
      <value-group caption="CRC Enable bit" name="DCRCCON__CRCEN">
         <value caption="CRC module is enabled and channel transfers are routed through the CRC module" name="" value="0x1" />
         <value caption="CRC module is disabled and channel transfers proceed normally" name="" value="0x0" />
      </value-group>
      <value-group caption="Polynomial Length bits" name="DCRCCON__PLEN">
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 30" name="" value="0x1f" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 29" name="" value="0x1e" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 28" name="" value="0x1d" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 27" name="" value="0x1c" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 26" name="" value="0x1b" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 25" name="" value="0x1a" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 24" name="" value="0x19" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 23" name="" value="0x18" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 22" name="" value="0x17" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 21" name="" value="0x16" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 20" name="" value="0x15" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 19" name="" value="0x14" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 18" name="" value="0x13" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 17" name="" value="0x12" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 16" name="" value="0x11" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 15" name="" value="0x10" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 14" name="" value="0xf" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 13" name="" value="0xe" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 12" name="" value="0xd" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 11" name="" value="0xc" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 10" name="" value="0xb" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 9" name="" value="0xa" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 8" name="" value="0x9" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 7" name="" value="0x8" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 6" name="" value="0x7" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 5" name="" value="0x6" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 4" name="" value="0x5" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 3" name="" value="0x4" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 2" name="" value="0x3" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 1" name="" value="0x2" />
         <value caption="(When CRCTYP=1) These bits are unused / (When CRCTYP=0) Polynomial length is 0" name="" value="0x1" />
      </value-group>
