Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM048.atdf
         <register caption="" name="RPOR0" offset="0x200" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP1R" />
            <bitfield caption="" mask="0x00001F00" name="RP2R" />
            <bitfield caption="" mask="0x001F0000" name="RP3R" />
            <bitfield caption="" mask="0x1F000000" name="RP4R" />
         </register>
         <register caption="" name="RPOR1" offset="0x210" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP5R" />
            <bitfield caption="" mask="0x00001F00" name="RP6R" />
            <bitfield caption="" mask="0x001F0000" name="RP7R" />
            <bitfield caption="" mask="0x1F000000" name="RP8R" />
         </register>
         <register caption="" name="RPOR2" offset="0x220" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP9R" />
            <bitfield caption="" mask="0x00001F00" name="RP10R" />
            <bitfield caption="" mask="0x001F0000" name="RP11R" />
            <bitfield caption="" mask="0x1F000000" name="RP12R" />
         </register>
         <register caption="" name="RPOR3" offset="0x230" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP13R" />
            <bitfield caption="" mask="0x00001F00" name="RP14R" />
            <bitfield caption="" mask="0x001F0000" name="RP15R" />
            <bitfield caption="" mask="0x1F000000" name="RP16R" />
         </register>
         <register caption="" name="RPOR4" offset="0x240" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP17R" />
            <bitfield caption="" mask="0x00001F00" name="RP18R" />
            <bitfield caption="" mask="0x001F0000" name="RP19R" />
            <bitfield caption="" mask="0x1F000000" name="RP20R" />
         </register>
         <register caption="" name="RPOR5" offset="0x250" rw="RW" size="4">
            <bitfield caption="" mask="0x0000001F" name="RP21R" />
            <bitfield caption="" mask="0x00001F00" name="RP22R" />
            <bitfield caption="" mask="0x001F0000" name="RP23R" />
            <bitfield caption="" mask="0x1F000000" name="RP24R" />
         </register>
         <register caption="" name="ANSELA" offset="0x2a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSA0" />
            <bitfield caption="" mask="0x00000002" name="ANSA1" />
            <bitfield caption="" mask="0x00000004" name="ANSA2" />
            <bitfield caption="" mask="0x00000008" name="ANSA3" />
            <bitfield caption="" mask="0x00000040" name="ANSA6" />
         </register>
         <register caption="" name="TRISA" offset="0x2b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISA0" />
            <bitfield caption="" mask="0x00000002" name="TRISA1" />
            <bitfield caption="" mask="0x00000004" name="TRISA2" />
            <bitfield caption="" mask="0x00000008" name="TRISA3" />
            <bitfield caption="" mask="0x00000010" name="TRISA4" />
            <bitfield caption="" mask="0x00000020" name="TRISA5" />
            <bitfield caption="" mask="0x00000040" name="TRISA6" />
            <bitfield caption="" mask="0x00000080" name="TRISA7" />
            <bitfield caption="" mask="0x00000100" name="TRISA8" />
            <bitfield caption="" mask="0x00000200" name="TRISA9" />
            <bitfield caption="" mask="0x00000400" name="TRISA10" />
            <bitfield caption="" mask="0x00008000" name="TRISA15" />
         </register>
         <register caption="" name="PORTA" offset="0x2c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RA0" />
            <bitfield caption="" mask="0x00000002" name="RA1" />
            <bitfield caption="" mask="0x00000004" name="RA2" />
            <bitfield caption="" mask="0x00000008" name="RA3" />
            <bitfield caption="" mask="0x00000010" name="RA4" />
            <bitfield caption="" mask="0x00000020" name="RA5" />
            <bitfield caption="" mask="0x00000040" name="RA6" />
            <bitfield caption="" mask="0x00000080" name="RA7" />
            <bitfield caption="" mask="0x00000100" name="RA8" />
            <bitfield caption="" mask="0x00000200" name="RA9" />
            <bitfield caption="" mask="0x00000400" name="RA10" />
            <bitfield caption="" mask="0x00008000" name="RA15" />
         </register>
         <register caption="" name="LATA" offset="0x2d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATA0" />
            <bitfield caption="" mask="0x00000002" name="LATA1" />
            <bitfield caption="" mask="0x00000004" name="LATA2" />
            <bitfield caption="" mask="0x00000008" name="LATA3" />
            <bitfield caption="" mask="0x00000010" name="LATA4" />
            <bitfield caption="" mask="0x00000020" name="LATA5" />
            <bitfield caption="" mask="0x00000040" name="LATA6" />
            <bitfield caption="" mask="0x00000080" name="LATA7" />
            <bitfield caption="" mask="0x00000100" name="LATA8" />
            <bitfield caption="" mask="0x00000200" name="LATA9" />
            <bitfield caption="" mask="0x00000400" name="LATA10" />
            <bitfield caption="" mask="0x00008000" name="LATA15" />
         </register>
         <register caption="" name="ODCA" offset="0x2e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCA0" />
            <bitfield caption="" mask="0x00000002" name="ODCA1" />
            <bitfield caption="" mask="0x00000004" name="ODCA2" />
            <bitfield caption="" mask="0x00000008" name="ODCA3" />
            <bitfield caption="" mask="0x00000010" name="ODCA4" />
            <bitfield caption="" mask="0x00000020" name="ODCA5" />
            <bitfield caption="" mask="0x00000040" name="ODCA6" />
            <bitfield caption="" mask="0x00000080" name="ODCA7" />
            <bitfield caption="" mask="0x00000100" name="ODCA8" />
            <bitfield caption="" mask="0x00000200" name="ODCA9" />
            <bitfield caption="" mask="0x00000400" name="ODCA10" />
            <bitfield caption="" mask="0x00008000" name="ODCA15" />
         </register>
