Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM048.atdf
         <register caption="" name="CNPUA" offset="0x2f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUA0" />
            <bitfield caption="" mask="0x00000002" name="CNPUA1" />
            <bitfield caption="" mask="0x00000004" name="CNPUA2" />
            <bitfield caption="" mask="0x00000008" name="CNPUA3" />
            <bitfield caption="" mask="0x00000010" name="CNPUA4" />
            <bitfield caption="" mask="0x00000020" name="CNPUA5" />
            <bitfield caption="" mask="0x00000040" name="CNPUA6" />
            <bitfield caption="" mask="0x00000080" name="CNPUA7" />
            <bitfield caption="" mask="0x00000100" name="CNPUA8" />
            <bitfield caption="" mask="0x00000200" name="CNPUA9" />
            <bitfield caption="" mask="0x00000400" name="CNPUA10" />
            <bitfield caption="" mask="0x00008000" name="CNPUA15" />
         </register>
         <register caption="" name="CNPDA" offset="0x300" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDA0" />
            <bitfield caption="" mask="0x00000002" name="CNPDA1" />
            <bitfield caption="" mask="0x00000004" name="CNPDA2" />
            <bitfield caption="" mask="0x00000008" name="CNPDA3" />
            <bitfield caption="" mask="0x00000010" name="CNPDA4" />
            <bitfield caption="" mask="0x00000020" name="CNPDA5" />
            <bitfield caption="" mask="0x00000040" name="CNPDA6" />
            <bitfield caption="" mask="0x00000080" name="CNPDA7" />
            <bitfield caption="" mask="0x00000100" name="CNPDA8" />
            <bitfield caption="" mask="0x00000200" name="CNPD9" />
            <bitfield caption="" mask="0x00000400" name="CNPDA10" />
            <bitfield caption="" mask="0x00008000" name="CNPDA15" />
         </register>
         <register caption="" name="CNCONA" offset="0x310" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNEN0A" offset="0x320" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0A0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0A1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0A2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0A3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0A4" />
            <bitfield caption="" mask="0x00000020" name="CNIE0A5" />
            <bitfield caption="" mask="0x00000040" name="CNIE0A6" />
            <bitfield caption="" mask="0x00000080" name="CNIE0A7" />
            <bitfield caption="" mask="0x00000100" name="CNIE0A8" />
            <bitfield caption="" mask="0x00000200" name="CNIE0A9" />
            <bitfield caption="" mask="0x00000400" name="CNIE0A10" />
            <bitfield caption="" mask="0x00008000" name="CNIE0A15" />
         </register>
         <register caption="" name="CNSTATA" offset="0x330" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATA0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATA1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATA2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATA3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATA4" />
            <bitfield caption="" mask="0x00000020" name="CNSTATA5" />
            <bitfield caption="" mask="0x00000040" name="CNSTATA6" />
            <bitfield caption="" mask="0x00000080" name="CNSTATA7" />
            <bitfield caption="" mask="0x00000100" name="CNSTATA8" />
            <bitfield caption="" mask="0x00000200" name="CNSTATA9" />
            <bitfield caption="" mask="0x00000400" name="CNSTATA10" />
            <bitfield caption="" mask="0x00008000" name="CNSTATA15" />
         </register>
         <register caption="" name="CNEN1A" offset="0x340" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1A0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1A1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1A2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1A3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1A4" />
            <bitfield caption="" mask="0x00000020" name="CNIE1A5" />
            <bitfield caption="" mask="0x00000040" name="CNIE1A6" />
            <bitfield caption="" mask="0x00000080" name="CNIE1A7" />
            <bitfield caption="" mask="0x00000100" name="CNIE1A8" />
            <bitfield caption="" mask="0x00000200" name="CNIE1A9" />
            <bitfield caption="" mask="0x00000400" name="CNIE1A10" />
            <bitfield caption="" mask="0x00008000" name="CNIE1A15" />
         </register>
         <register caption="" name="CNFA" offset="0x350" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFA0" />
            <bitfield caption="" mask="0x00000002" name="CNFA1" />
            <bitfield caption="" mask="0x00000004" name="CNFA2" />
            <bitfield caption="" mask="0x00000008" name="CNFA3" />
            <bitfield caption="" mask="0x00000010" name="CNFA4" />
            <bitfield caption="" mask="0x00000020" name="CNFA5" />
            <bitfield caption="" mask="0x00000040" name="CNFA6" />
            <bitfield caption="" mask="0x00000080" name="CNFA7" />
            <bitfield caption="" mask="0x00000100" name="CNFA8" />
            <bitfield caption="" mask="0x00000200" name="CNFA9" />
            <bitfield caption="" mask="0x00000400" name="CNFA10" />
            <bitfield caption="" mask="0x00008000" name="CNFA15" />
         </register>
         <register caption="" name="SR0A" offset="0x360" rw="RW" size="4" />
         <register caption="" name="SR1A" offset="0x370" rw="RW" size="4" />
         <register caption="" name="ANSELB" offset="0x3a0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ANSB0" />
            <bitfield caption="" mask="0x00000002" name="ANSB1" />
            <bitfield caption="" mask="0x00000004" name="ANSB2" />
            <bitfield caption="" mask="0x00000008" name="ANSB3" />
            <bitfield caption="" mask="0x00000010" name="ANSB4" />
            <bitfield caption="" mask="0x00002000" name="ANSB13" />
            <bitfield caption="" mask="0x00004000" name="ANSB14" />
            <bitfield caption="" mask="0x00008000" name="ANSB15" />
         </register>
         <register caption="" name="TRISB" offset="0x3b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISB0" />
            <bitfield caption="" mask="0x00000002" name="TRISB1" />
            <bitfield caption="" mask="0x00000004" name="TRISB2" />
            <bitfield caption="" mask="0x00000008" name="TRISB3" />
            <bitfield caption="" mask="0x00000010" name="TRISB4" />
            <bitfield caption="" mask="0x00000020" name="TRISB5" />
            <bitfield caption="" mask="0x00000040" name="TRISB6" />
            <bitfield caption="" mask="0x00000080" name="TRISB7" />
            <bitfield caption="" mask="0x00000100" name="TRISB8" />
            <bitfield caption="" mask="0x00000200" name="TRISB9" />
            <bitfield caption="" mask="0x00000400" name="TRISB10" />
            <bitfield caption="" mask="0x00000800" name="TRISB11" />
            <bitfield caption="" mask="0x00002000" name="TRISB13" />
            <bitfield caption="" mask="0x00004000" name="TRISB14" />
            <bitfield caption="" mask="0x00008000" name="TRISB15" />
         </register>
         <register caption="" name="PORTB" offset="0x3c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RB0" />
            <bitfield caption="" mask="0x00000002" name="RB1" />
            <bitfield caption="" mask="0x00000004" name="RB2" />
            <bitfield caption="" mask="0x00000008" name="RB3" />
            <bitfield caption="" mask="0x00000010" name="RB4" />
            <bitfield caption="" mask="0x00000020" name="RB5" />
            <bitfield caption="" mask="0x00000040" name="RB6" />
            <bitfield caption="" mask="0x00000080" name="RB7" />
            <bitfield caption="" mask="0x00000100" name="RB8" />
            <bitfield caption="" mask="0x00000200" name="RB9" />
            <bitfield caption="" mask="0x00000400" name="RB10" />
            <bitfield caption="" mask="0x00000800" name="RB11" />
            <bitfield caption="" mask="0x00002000" name="RB13" />
            <bitfield caption="" mask="0x00004000" name="RB14" />
            <bitfield caption="" mask="0x00008000" name="RB15" />
         </register>
         <register caption="" name="LATB" offset="0x3d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATB0" />
            <bitfield caption="" mask="0x00000002" name="LATB1" />
            <bitfield caption="" mask="0x00000004" name="LATB2" />
            <bitfield caption="" mask="0x00000008" name="LATB3" />
            <bitfield caption="" mask="0x00000010" name="LATB4" />
            <bitfield caption="" mask="0x00000020" name="LATB5" />
            <bitfield caption="" mask="0x00000040" name="LATB6" />
            <bitfield caption="" mask="0x00000080" name="LATB7" />
            <bitfield caption="" mask="0x00000100" name="LATB8" />
            <bitfield caption="" mask="0x00000200" name="LATB9" />
            <bitfield caption="" mask="0x00000400" name="LATB10" />
            <bitfield caption="" mask="0x00000800" name="LATB11" />
            <bitfield caption="" mask="0x00002000" name="LATB13" />
            <bitfield caption="" mask="0x00004000" name="LATB14" />
            <bitfield caption="" mask="0x00008000" name="LATB15" />
         </register>
         <register caption="" name="ODCB" offset="0x3e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCB0" />
            <bitfield caption="" mask="0x00000002" name="ODCB1" />
            <bitfield caption="" mask="0x00000004" name="ODCB2" />
            <bitfield caption="" mask="0x00000008" name="ODCB3" />
            <bitfield caption="" mask="0x00000010" name="ODCB4" />
            <bitfield caption="" mask="0x00000020" name="ODCB5" />
            <bitfield caption="" mask="0x00000040" name="ODCB6" />
            <bitfield caption="" mask="0x00000080" name="ODCB7" />
            <bitfield caption="" mask="0x00000100" name="ODCB8" />
            <bitfield caption="" mask="0x00000200" name="ODCB9" />
            <bitfield caption="" mask="0x00000400" name="ODCB10" />
            <bitfield caption="" mask="0x00000800" name="ODCB11" />
            <bitfield caption="" mask="0x00002000" name="ODCB13" />
            <bitfield caption="" mask="0x00004000" name="ODCB14" />
            <bitfield caption="" mask="0x00008000" name="ODCB15" />
         </register>
         <register caption="" name="CNPUB" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUB0" />
            <bitfield caption="" mask="0x00000002" name="CNPUB1" />
            <bitfield caption="" mask="0x00000004" name="CNPUB2" />
            <bitfield caption="" mask="0x00000008" name="CNPUB3" />
            <bitfield caption="" mask="0x00000010" name="CNPUB4" />
            <bitfield caption="" mask="0x00000020" name="CNPUB5" />
            <bitfield caption="" mask="0x00000040" name="CNPUB6" />
            <bitfield caption="" mask="0x00000080" name="CNPUB7" />
            <bitfield caption="" mask="0x00000100" name="CNPUB8" />
            <bitfield caption="" mask="0x00000200" name="CNPUB9" />
            <bitfield caption="" mask="0x00000400" name="CNPUB10" />
            <bitfield caption="" mask="0x00000800" name="CNPUB11" />
            <bitfield caption="" mask="0x00002000" name="CNPUB13" />
            <bitfield caption="" mask="0x00004000" name="CNPUB14" />
            <bitfield caption="" mask="0x00008000" name="CNPUB15" />
         </register>
         <register caption="" name="CNPDB" offset="0x400" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDB0" />
            <bitfield caption="" mask="0x00000002" name="CNPDB1" />
            <bitfield caption="" mask="0x00000004" name="CNPDB2" />
            <bitfield caption="" mask="0x00000008" name="CNPDB3" />
            <bitfield caption="" mask="0x00000010" name="CNPDB4" />
            <bitfield caption="" mask="0x00000020" name="CNPDB5" />
            <bitfield caption="" mask="0x00000040" name="CNPDB6" />
            <bitfield caption="" mask="0x00000080" name="CNPDB7" />
            <bitfield caption="" mask="0x00000100" name="CNPDB8" />
            <bitfield caption="" mask="0x00000200" name="CNPDB9" />
            <bitfield caption="" mask="0x00000400" name="CNPDB10" />
            <bitfield caption="" mask="0x00000800" name="CNPDB11" />
            <bitfield caption="" mask="0x00002000" name="CNPDB13" />
            <bitfield caption="" mask="0x00004000" name="CNPDB14" />
            <bitfield caption="" mask="0x00008000" name="CNPDB15" />
         </register>
         <register caption="" name="CNCONB" offset="0x410" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
