Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM048.atdf
         <register caption="" name="CNEN0C" offset="0x520" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0C0" />
            <bitfield caption="" mask="0x00000002" name="CNIE0C1" />
            <bitfield caption="" mask="0x00000004" name="CNIE0C2" />
            <bitfield caption="" mask="0x00000008" name="CNIE0C3" />
            <bitfield caption="" mask="0x00000010" name="CNIE0C4" />
            <bitfield caption="" mask="0x00000020" name="CNIE0C5" />
            <bitfield caption="" mask="0x00000040" name="CNIE0C6" />
            <bitfield caption="" mask="0x00000080" name="CNIE0C7" />
            <bitfield caption="" mask="0x00000100" name="CNIE0C8" />
            <bitfield caption="" mask="0x00000200" name="CNIE0C9" />
            <bitfield caption="" mask="0x00001000" name="CNIE0C12" />
         </register>
         <register caption="" name="CNSTATC" offset="0x530" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATC0" />
            <bitfield caption="" mask="0x00000002" name="CNSTATC1" />
            <bitfield caption="" mask="0x00000004" name="CNSTATC2" />
            <bitfield caption="" mask="0x00000008" name="CNSTATC3" />
            <bitfield caption="" mask="0x00000010" name="CNSTATC4" />
            <bitfield caption="" mask="0x00000020" name="CNSTATC5" />
            <bitfield caption="" mask="0x00000040" name="CNSTATC6" />
            <bitfield caption="" mask="0x00000080" name="CNSTATC7" />
            <bitfield caption="" mask="0x00000100" name="CNSTATC8" />
            <bitfield caption="" mask="0x00000200" name="CNSTATC9" />
            <bitfield caption="" mask="0x00001000" name="CNSTATC12" />
         </register>
         <register caption="" name="CNEN1C" offset="0x540" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1C0" />
            <bitfield caption="" mask="0x00000002" name="CNIE1C1" />
            <bitfield caption="" mask="0x00000004" name="CNIE1C2" />
            <bitfield caption="" mask="0x00000008" name="CNIE1C3" />
            <bitfield caption="" mask="0x00000010" name="CNIE1C4" />
            <bitfield caption="" mask="0x00000020" name="CNIE1C5" />
            <bitfield caption="" mask="0x00000040" name="CNIE1C6" />
            <bitfield caption="" mask="0x00000080" name="CNIE1C7" />
            <bitfield caption="" mask="0x00000100" name="CNIE1C8" />
            <bitfield caption="" mask="0x00000200" name="CNIE1C9" />
            <bitfield caption="" mask="0x00001000" name="CNIE1C12" />
         </register>
         <register caption="" name="CNFC" offset="0x550" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFC0" />
            <bitfield caption="" mask="0x00000002" name="CNFC1" />
            <bitfield caption="" mask="0x00000004" name="CNFC2" />
            <bitfield caption="" mask="0x00000008" name="CNFC3" />
            <bitfield caption="" mask="0x00000010" name="CNFC4" />
            <bitfield caption="" mask="0x00000020" name="CNFC5" />
            <bitfield caption="" mask="0x00000040" name="CNFC6" />
            <bitfield caption="" mask="0x00000080" name="CNFC7" />
            <bitfield caption="" mask="0x00000100" name="CNFC8" />
            <bitfield caption="" mask="0x00000200" name="CNFC9" />
            <bitfield caption="" mask="0x00001000" name="CNFC12" />
         </register>
         <register caption="" name="SR0C" offset="0x560" rw="R" size="4" />
         <register caption="" name="SR1C" offset="0x570" rw="R" size="4" />
         <register caption="" name="ANSELD" offset="0x5a0" rw="R" size="4" />
         <register caption="" name="TRISD" offset="0x5b0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="TRISD0" />
         </register>
         <register caption="" name="PORTD" offset="0x5c0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RD0" />
         </register>
         <register caption="" name="LATD" offset="0x5d0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="LATD0" />
         </register>
         <register caption="" name="ODCD" offset="0x5e0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="ODCD0" />
         </register>
         <register caption="" name="CNPUD" offset="0x5f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPUD0" />
         </register>
         <register caption="" name="CNPDD" offset="0x600" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNPDD0" />
         </register>
         <register caption="" name="CNCOND" offset="0x610" rw="RW" size="4">
            <bitfield caption="" mask="0x00000400" name="PORT32" />
            <bitfield caption="" mask="0x00000800" name="CNSTYLE" />
            <bitfield caption="" mask="0x00008000" name="ON" />
         </register>
         <register caption="" name="CNEN0D" offset="0x620" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE0D0" />
         </register>
         <register caption="" name="CNSTATD" offset="0x630" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNSTATD0" />
         </register>
         <register caption="" name="CNEN1D" offset="0x640" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNIE1D0" />
         </register>
         <register caption="" name="CNFD" offset="0x650" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CNFD0" />
         </register>
         <register caption="" name="SR0D" offset="0x660" rw="R" size="4" />
         <register caption="" name="SR1D" offset="0x670" rw="R" size="4" />
      </register-group>
   </module>
   <module caption="" id="02511" name="HLVD" version="">
      <register-group name="HLVD">
         <register caption="High/Low-Voltage Detect Control Register" name="HLVDCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="High/Low-Voltage Detection Limit Select bits" mask="0x0000000F" name="HLVDL" values="HLVDCON__HLVDL" />
            <bitfield caption="High/Low-Voltage Detection Event Status bit" mask="0x00000100" name="HLVDET" values="HLVDCON__HLVDET" />
            <bitfield caption="Internal Reference Voltage Stable Status bit" mask="0x00000200" name="IRVST" values="HLVDCON__IRVST" />
            <bitfield caption="Band Gap Reference Voltages Stable Status bit" mask="0x00000400" name="BGVST" values="HLVDCON__BGVST" />
            <bitfield caption="Voltage Change Direction Select bit" mask="0x00000800" name="VDIR" values="HLVDCON__VDIR" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="HLVD Module Enable bit" mask="0x00008000" name="ON" values="HLVDCON__ON" />
         </register>
      </register-group>
      <value-group caption="High/Low-Voltage Detection Limit Select bits" name="HLVDCON__HLVDL">
         <value caption="External LVDIN pin" name="" value="0xf" />
         <value caption="VDD trip point is between 2.00V and 2.22V" name="" value="0xe" />
         <value caption="VDD trip point is between 2.08V and 2.33V" name="" value="0xd" />
         <value caption="VDD trip point is between 2.15V and 2.44V" name="" value="0xc" />
         <value caption="VDD trip point is between 2.25V and 2.55V" name="" value="0xb" />
         <value caption="VDD trip point is between 2.35V and 2.69V" name="" value="0xa" />
         <value caption="VDD trip point is between 2.45V and 2.80V" name="" value="0x9" />
         <value caption="VDD trip point is between 2.65V and 2.98V" name="" value="0x8" />
         <value caption="VDD trip point is between 2.75V and 3.09V" name="" value="0x7" />
         <value caption="VDD trip point is between 2.95V and 3.30V" name="" value="0x6" />
         <value caption="VDD trip point is between 3.25V and 3.63V" name="" value="0x5" />
         <value caption="Reserved; do not use" name="" value="0x4" />
         <value caption="Reserved; do not use" name="" value="0x3" />
         <value caption="Reserved; do not use" name="" value="0x2" />
         <value caption="Reserved; do not use" name="" value="0x1" />
         <value caption="Reserved; do not use" name="" value="0x0" />
      </value-group>
      <value-group caption="High/Low-Voltage Detection Event Status bit" name="HLVDCON__HLVDET">
         <value caption="Indicates HLVD Event interrupt is active" name="" value="0x1" />
         <value caption="Indicates HLVD Event interrupt is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Internal Reference Voltage Stable Status bit" name="HLVDCON__IRVST">
         <value caption="Indicates internal reference voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal reference voltage reference is not stable" name="" value="0x0" />
      </value-group>
