Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM048.atdf
      <value-group caption="Band Gap Reference Voltages Stable Status bit" name="HLVDCON__BGVST">
         <value caption="Indicates internal band gap voltage references is stable" name="" value="0x1" />
         <value caption="Indicates internal band gap voltage reference is not stable" name="" value="0x0" />
      </value-group>
      <value-group caption="Voltage Change Direction Select bit" name="HLVDCON__VDIR">
         <value caption="Event occurs when voltage equals or exceeds the trip point (HLVDL)" name="" value="0x1" />
         <value caption="Event occurs when voltage equals or falls below the trip point (HLVDL)" name="" value="0x0" />
      </value-group>
      <value-group caption="HLVD Module Enable bit" name="HLVDCON__ON">
         <value caption="HLVD module is enabled" name="" value="0x1" />
         <value caption="HLVD module is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="01441" name="I2C" version="">
      <register-group name="I2C">
         <register caption="" name="I2C1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C1CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C1CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C1CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C1CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C1CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C1CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C1CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C1CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C1CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C1CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C1CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C1CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C1CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C1CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C1CON__ON" />
            <bitfield caption="" mask="0x00040000" name="SBCDE" values="I2C1CON__SBCDE" />
            <bitfield caption="" mask="0x00080000" name="SDAHT" values="I2C1CON__SDAHT" />
            <bitfield caption="" mask="0x00100000" name="BOEN" values="I2C1CON__BOEN" />
            <bitfield caption="" mask="0x00200000" name="SCIE" values="I2C1CON__SCIE" />
            <bitfield caption="" mask="0x00400000" name="PCIE" values="I2C1CON__PCIE" />
         </register>
         <register caption="" name="I2C2CON" offset="0x100" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C2CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C2CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C2CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C2CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C2CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C2CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C2CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C2CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C2CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C2CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C2CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C2CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C2CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C2CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C2CON__ON" />
            <bitfield caption="" mask="0x00040000" name="SBCDE" values="I2C2CON__SBCDE" />
            <bitfield caption="" mask="0x00080000" name="SDAHT" values="I2C2CON__SDAHT" />
            <bitfield caption="" mask="0x00100000" name="BOEN" values="I2C2CON__BOEN" />
            <bitfield caption="" mask="0x00200000" name="SCIE" values="I2C2CON__SCIE" />
            <bitfield caption="" mask="0x00400000" name="PCIE" values="I2C2CON__PCIE" />
         </register>
         <register caption="" name="I2C3CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Start Condition Enable bit (when operating as I2C master)" mask="0x00000001" name="SEN" values="I2C3CON__SEN" />
            <bitfield caption="Repeated Start Condition Enable bit (when operating as I2C master)" mask="0x00000002" name="RSEN" values="I2C3CON__RSEN" />
            <bitfield caption="Stop Condition Enable bit (when operating as I2C master)" mask="0x00000004" name="PEN" values="I2C3CON__PEN" />
            <bitfield caption="Receive Enable bit (when operating as I2C master)" mask="0x00000008" name="RCEN" values="I2C3CON__RCEN" />
            <bitfield caption="Acknowledge Sequence Enable bit" mask="0x00000010" name="ACKEN" values="I2C3CON__ACKEN" />
            <bitfield caption="Acknowledge Data bit (when operating as I2C master, applicable during master receive)" mask="0x00000020" name="ACKDT" values="I2C3CON__ACKDT" />
            <bitfield caption="SCLx Clock Stretch Enable bit (when operating as I2C slave)" mask="0x00000040" name="STREN" values="I2C3CON__STREN" />
            <bitfield caption="General Call Enable bit (when operating as I2C slave)" mask="0x00000080" name="GCEN" values="I2C3CON__GCEN" />
            <bitfield caption="SMBus Input Levels bit" mask="0x00000100" name="SMEN" values="I2C3CON__SMEN" />
            <bitfield caption="Disable Slew Rate Control bit" mask="0x00000200" name="DISSLW" values="I2C3CON__DISSLW" />
            <bitfield caption="10-bit Slave Address bit" mask="0x00000400" name="A10M" values="I2C3CON__A10M" />
            <bitfield caption="Strict I 2 C Reserved Address Rule Enable bit" mask="0x00000800" name="STRICT" values="I2C3CON__STRICT" />
            <bitfield caption="SCLx Release Control bit (when operating as I2C slave)" mask="0x00001000" name="SCLREL" values="I2C3CON__SCLREL" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="I2C3CON__SIDL" />
            <bitfield caption="I2C Enable bit" mask="0x00008000" name="ON" values="I2C3CON__ON" />
            <bitfield caption="" mask="0x00040000" name="SBCDE" values="I2C3CON__SBCDE" />
            <bitfield caption="" mask="0x00080000" name="SDAHT" values="I2C3CON__SDAHT" />
            <bitfield caption="" mask="0x00100000" name="BOEN" values="I2C3CON__BOEN" />
            <bitfield caption="" mask="0x00200000" name="SCIE" values="I2C3CON__SCIE" />
            <bitfield caption="" mask="0x00400000" name="PCIE" values="I2C3CON__PCIE" />
         </register>
         <register caption="" name="I2C1STAT" offset="0x10" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C1STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C1STAT__RBF" />
            <bitfield caption="Read/Write Information bit (when operating as I2C slave)" mask="0x00000004" name="R_W" values="I2C1STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C1STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C1STAT__P" />
            <bitfield caption="Data/Address bit (when operating as I2C slave)" mask="0x00000020" name="D_A" values="I2C1STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C1STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C1STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C1STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C1STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C1STAT__BCL" />
            <bitfield caption="" mask="0x00002000" name="ACKTIM" />
            <bitfield caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00004000" name="TRSTAT" values="I2C1STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00008000" name="ACKSTAT" values="I2C1STAT__ACKSTAT" />
         </register>
         <register caption="" name="I2C2STAT" offset="0x110" rw="R" size="4">
            <bitfield caption="Transmit Buffer Full Status bit" mask="0x00000001" name="TBF" values="I2C2STAT__TBF" />
            <bitfield caption="Receive Buffer Full Status bit" mask="0x00000002" name="RBF" values="I2C2STAT__RBF" />
            <bitfield caption="Read/Write Information bit (when operating as I2C slave)" mask="0x00000004" name="R_W" values="I2C2STAT__R_W" />
            <bitfield caption="Start bit" mask="0x00000008" name="S" values="I2C2STAT__S" />
            <bitfield caption="Stop bit" mask="0x00000010" name="P" values="I2C2STAT__P" />
            <bitfield caption="Data/Address bit (when operating as I2C slave)" mask="0x00000020" name="D_A" values="I2C2STAT__D_A" />
            <bitfield caption="Receive Overflow Flag bit" mask="0x00000040" name="I2COV" values="I2C2STAT__I2COV" />
            <bitfield caption="Write Collision Detect bit" mask="0x00000080" name="IWCOL" values="I2C2STAT__IWCOL" />
            <bitfield caption="10-bit Address Status bit" mask="0x00000100" name="ADD10" values="I2C2STAT__ADD10" />
            <bitfield caption="General Call Status bit" mask="0x00000200" name="GCSTAT" values="I2C2STAT__GCSTAT" />
            <bitfield caption="Master Bus Collision Detect bit" mask="0x00000400" name="BCL" values="I2C2STAT__BCL" />
            <bitfield caption="" mask="0x00002000" name="ACKTIM" />
            <bitfield caption="Transmit Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00004000" name="TRSTAT" values="I2C2STAT__TRSTAT" />
            <bitfield caption="Acknowledge Status bit (when operating as I2C master, applicable to master transmit operation)" mask="0x00008000" name="ACKSTAT" values="I2C2STAT__ACKSTAT" />
         </register>
