Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM-GPM-0XX_DFP/1.3.50/atdf/PIC32MM0064GPM048.atdf
         <register caption="" name="IFS2" offset="0x80f0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000002" name="I2C1SIF" />
            <bitfield caption="" mask="0x00000004" name="I2C1MIF" />
            <bitfield caption="" mask="0x00000008" name="I2C1BCIF" />
            <bitfield caption="" mask="0x00000010" name="I2C2SIF" />
            <bitfield caption="" mask="0x00000020" name="I2C2MIF" />
            <bitfield caption="" mask="0x00000040" name="I2C2BCIF" />
            <bitfield caption="" mask="0x00000080" name="I2C3SIF" />
            <bitfield caption="" mask="0x00000100" name="I2C3MIF" />
            <bitfield caption="" mask="0x00000200" name="I2C3BCIF" />
            <bitfield caption="" mask="0x00000400" name="CCP1IF" />
            <bitfield caption="" mask="0x00000800" name="CCT1IF" />
            <bitfield caption="" mask="0x00001000" name="CCP2IF" />
            <bitfield caption="" mask="0x00002000" name="CCT2IF" />
            <bitfield caption="" mask="0x00004000" name="CCP3IF" />
            <bitfield caption="" mask="0x00008000" name="CCT3IF" />
            <bitfield caption="" mask="0x00010000" name="CCP4IF" />
            <bitfield caption="" mask="0x00020000" name="CCT4IF" />
            <bitfield caption="" mask="0x00040000" name="CCP5IF" />
            <bitfield caption="" mask="0x00080000" name="CCT5IF" />
            <bitfield caption="" mask="0x00100000" name="CCP6IF" />
            <bitfield caption="" mask="0x00200000" name="CCT6IF" />
            <bitfield caption="" mask="0x00400000" name="CCP7IF" />
            <bitfield caption="" mask="0x00800000" name="CCT7IF" />
            <bitfield caption="" mask="0x01000000" name="CCP8IF" />
            <bitfield caption="" mask="0x02000000" name="CCT8IF" />
            <bitfield caption="" mask="0x04000000" name="CCP9IF" />
            <bitfield caption="" mask="0x08000000" name="CCT9IF" />
            <bitfield caption="" mask="0x10000000" name="FSTIF" />
            <bitfield caption="" mask="0x40000000" name="NVMIF" />
            <bitfield caption="" mask="0x80000000" name="CPCIF" />
         </register>
         <register caption="" name="IFS3" offset="0x8100" rw="RW" size="4">
            <bitfield caption="" mask="0x00000002" name="ECCBEIF" />
            <bitfield caption="" mask="0x00000004" name="DMA0IF" />
            <bitfield caption="" mask="0x00000008" name="DMA1IF" />
            <bitfield caption="" mask="0x00000010" name="DMA2IF" />
            <bitfield caption="" mask="0x00000020" name="DMA3IF" />
         </register>
         <register caption="" name="IEC0" offset="0x8150" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="CTIE" />
            <bitfield caption="" mask="0x00000002" name="CS0IE" />
            <bitfield caption="" mask="0x00000004" name="CS1IE" />
            <bitfield caption="" mask="0x00000008" name="INT0IE" />
            <bitfield caption="" mask="0x00000010" name="INT1IE" />
            <bitfield caption="" mask="0x00000020" name="INT2IE" />
            <bitfield caption="" mask="0x00000040" name="INT3IE" />
            <bitfield caption="" mask="0x00000080" name="INT4IE" />
            <bitfield caption="" mask="0x00000100" name="CNAIE" />
            <bitfield caption="" mask="0x00000200" name="CNBIE" />
            <bitfield caption="" mask="0x00000400" name="CNCIE" />
            <bitfield caption="" mask="0x00000800" name="CNDIE" />
            <bitfield caption="" mask="0x00020000" name="T1IE" />
            <bitfield caption="" mask="0x00040000" name="T2IE" />
            <bitfield caption="" mask="0x00080000" name="T3IE" />
            <bitfield caption="" mask="0x00800000" name="CMP1IE" />
            <bitfield caption="" mask="0x01000000" name="CMP2IE" />
            <bitfield caption="" mask="0x02000000" name="CMP3IE" />
            <bitfield caption="" mask="0x20000000" name="USBIE" />
         </register>
         <register caption="" name="IEC1" offset="0x8160" rw="RW" size="4">
            <bitfield caption="" mask="0x00000001" name="RTCCIE" />
            <bitfield caption="" mask="0x00000002" name="AD1IE" />
            <bitfield caption="" mask="0x00000010" name="LVDIE" />
            <bitfield caption="" mask="0x00000020" name="CLC1IE" />
            <bitfield caption="" mask="0x00000040" name="CLC2IE" />
            <bitfield caption="" mask="0x00000080" name="CLC3IE" />
            <bitfield caption="" mask="0x00000100" name="CLC4IE" />
            <bitfield caption="" mask="0x00000200" name="SPI1EIE" />
            <bitfield caption="" mask="0x00000400" name="SPI1TXIE" />
            <bitfield caption="" mask="0x00000800" name="SPI1RXIE" />
            <bitfield caption="" mask="0x00001000" name="SPI2EIE" />
            <bitfield caption="" mask="0x00002000" name="SPI2TXIE" />
            <bitfield caption="" mask="0x00004000" name="SPI2RXIE" />
            <bitfield caption="" mask="0x00008000" name="SPI3EIE" />
            <bitfield caption="" mask="0x00010000" name="SPI3TXIE" />
            <bitfield caption="" mask="0x00020000" name="SPI3RXIE" />
            <bitfield caption="" mask="0x00200000" name="U1RXIE" />
            <bitfield caption="" mask="0x00400000" name="U1TXIE" />
            <bitfield caption="" mask="0x00800000" name="U1EIE" />
            <bitfield caption="" mask="0x01000000" name="U2RXIE" />
            <bitfield caption="" mask="0x02000000" name="U2TXIE" />
            <bitfield caption="" mask="0x04000000" name="U2EIE" />
            <bitfield caption="" mask="0x08000000" name="U3RXIE" />
            <bitfield caption="" mask="0x10000000" name="U3TXIE" />
            <bitfield caption="" mask="0x20000000" name="U3EIE" />
         </register>
         <register caption="" name="IEC2" offset="0x8170" rw="RW" size="4">
            <bitfield caption="" mask="0x00000002" name="I2C1SIE" />
            <bitfield caption="" mask="0x00000004" name="I2C1MIE" />
            <bitfield caption="" mask="0x00000008" name="I2C1BCIE" />
            <bitfield caption="" mask="0x00000010" name="I2C2SIE" />
            <bitfield caption="" mask="0x00000020" name="I2C2MIE" />
            <bitfield caption="" mask="0x00000040" name="I2C2BCIE" />
            <bitfield caption="" mask="0x00000080" name="I2C3SIE" />
            <bitfield caption="" mask="0x00000100" name="I2C3MIE" />
            <bitfield caption="" mask="0x00000200" name="I2C3BCIE" />
            <bitfield caption="" mask="0x00000400" name="CCP1IE" />
            <bitfield caption="" mask="0x00000800" name="CCT1IE" />
            <bitfield caption="" mask="0x00001000" name="CCP2IE" />
            <bitfield caption="" mask="0x00002000" name="CCT2IE" />
            <bitfield caption="" mask="0x00004000" name="CCP3IE" />
            <bitfield caption="" mask="0x00008000" name="CCT3IE" />
            <bitfield caption="" mask="0x00010000" name="CCP4IE" />
            <bitfield caption="" mask="0x00020000" name="CCT4IE" />
            <bitfield caption="" mask="0x00040000" name="CCP5IE" />
            <bitfield caption="" mask="0x00080000" name="CCT5IE" />
            <bitfield caption="" mask="0x00100000" name="CCP6IE" />
            <bitfield caption="" mask="0x00200000" name="CCT6IE" />
            <bitfield caption="" mask="0x00400000" name="CCP7IE" />
            <bitfield caption="" mask="0x00800000" name="CCT7IE" />
            <bitfield caption="" mask="0x01000000" name="CCP8IE" />
            <bitfield caption="" mask="0x02000000" name="CCT8IE" />
            <bitfield caption="" mask="0x04000000" name="CCP9IE" />
            <bitfield caption="" mask="0x08000000" name="CCT9IE" />
            <bitfield caption="" mask="0x10000000" name="FSTIE" />
            <bitfield caption="" mask="0x40000000" name="NVMIE" />
            <bitfield caption="" mask="0x80000000" name="CPCIE" />
         </register>
         <register caption="" name="IEC3" offset="0x8180" rw="RW" size="4">
            <bitfield caption="" mask="0x00000002" name="ECCBEIE" />
            <bitfield caption="" mask="0x00000004" name="DMA0IE" />
            <bitfield caption="" mask="0x00000008" name="DMA1IE" />
            <bitfield caption="" mask="0x00000010" name="DMA2IE" />
            <bitfield caption="" mask="0x00000020" name="DMA3IE" />
         </register>
